Revit 2027 API
PlanTopology.Circuits Property
The Circuits of the PlanTopology.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PlanCircuitSet Circuits { get; }
Public ReadOnly Property Circuits As PlanCircuitSet
	Get
public:
property PlanCircuitSet^ Circuits {
	PlanCircuitSet^ get ();
}
member Circuits : PlanCircuitSet with get
Property Value
PlanCircuitSet
See Also
Reference
PlanTopology Class
Autodesk.Revit.DB Namespace